from plot_maker import PlotMaker, str_div

# x = str_div('''
# 12,58
# 6,29
# 3,14
# 1,57
# 0,78
# 0,39
# 0,19
# ''')
# x.reverse()
# y = str_div('''
# 1,0602
# 0,8155
# 0,7859
# 0,7461
# 0,6886
# 0,7089
# 0,7492
# ''')
# y.reverse()
#
# plt = PlotMaker('Зависимость времени обработки от разрешения изображения', 'Разрешение, Мп', 't, c',
#                 [[x, y]], connect_dots=True, file_name='test')
# plt.start()
# plt.make_plot()

x_50 = str_div('''
10
20
30
40
50
60
70
80
90
100
110
120
130
140
150
160
170
180
190
200
210
220
230
240
250
260
270
280
290
300
''')
y_50 = str_div('''
0
0,2908
0,8722
0,5948
0,8517
0,8822
0,8684
0,909
0,8997
0,9375
0,9072
0,909
0,7096
0,909
0,909
0,909
0,909
1
0,909
0,9964
1
1
0,9982
1
1
1
1
1
1
1
''')

x_5095 = str_div('''
''')
y_5095 = str_div('''
0
0,0915
0,3995
0,1711
0,2317
0,4403
0,4529
0,6184
0,3799
0,5864
0,6069
0,5221
0,4404
0,6199
0,6719
0,6224
0,6661
0,7366
0,5553
0,7264
0,6747
0,7027
0,7447
0,7371
0,7634
0,6673
0,6829
0,6752
0,78
0,8204
''')

plt_2 = PlotMaker('Зависимость mAP от числа эпох', 'N', 'mAP',
                  data=[[x_50, y_50, 'mAP_50'], [x_50, y_5095, 'mAP_5095']], connect_dots=True, file_name='test_2',
                  marker_lib=['o', '<'],
                  color_lib=['blue', 'orange'])
plt_2.start()
plt_2.make_plot()
